{
  "name": "cnn4_v2",
  "trainable": true,
  "layers": [
    {
      "module": "keras.layers",
      "class_name": "InputLayer",
      "config": {
        "batch_shape": [
          null,
          2,
          128,
          1
        ],
        "dtype": "float32",
        "sparse": false,
        "ragged": false,
        "name": "iq_input",
        "optional": false
      },
      "registered_name": null,
      "name": "iq_input",
      "inbound_nodes": []
    },
    {
      "module": "keras.layers",
      "class_name": "ZeroPadding2D",
      "config": {
        "name": "pad1",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "padding": [
          [
            0,
            0
          ],
          [
            2,
            2
          ]
        ],
        "data_format": "channels_last"
      },
      "registered_name": null,
      "build_config": {
        "input_shape": [
          null,
          2,
          128,
          1
        ]
      },
      "name": "pad1",
      "inbound_nodes": [
        {
          "args": [
            {
              "class_name": "__keras_tensor__",
              "config": {
                "shape": [
                  null,
                  2,
                  128,
                  1
                ],
                "dtype": "float32",
                "keras_history": [
                  "iq_input",
                  0,
                  0
                ]
              }
            }
          ],
          "kwargs": {}
        }
      ]
    },
    {
      "module": "keras.layers",
      "class_name": "Conv2D",
      "config": {
        "name": "conv1",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "filters": 64,
        "kernel_size": [
          1,
          8
        ],
        "strides": [
          1,
          1
        ],
        "padding": "valid",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "groups": 1,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "registered_name": null,
      "build_config": {
        "input_shape": [
          null,
          2,
          132,
          1
        ]
      },
      "name": "conv1",
      "inbound_nodes": [
        {
          "args": [
            {
              "class_name": "__keras_tensor__",
              "config": {
                "shape": [
                  null,
                  2,
                  132,
                  1
                ],
                "dtype": "float32",
                "keras_history": [
                  "pad1",
                  0,
                  0
                ]
              }
            }
          ],
          "kwargs": {}
        }
      ]
    },
    {
      "module": "keras.layers",
      "class_name": "BatchNormalization",
      "config": {
        "name": "bn1",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "gamma_initializer": {
          "module": "keras.initializers",
          "class_name": "Ones",
          "config": {},
          "registered_name": null
        },
        "moving_mean_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "moving_variance_initializer": {
          "module": "keras.initializers",
          "class_name": "Ones",
          "config": {},
          "registered_name": null
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null,
        "synchronized": false
      },
      "registered_name": null,
      "build_config": {
        "input_shape": [
          null,
          2,
          125,
          64
        ]
      },
      "name": "bn1",
      "inbound_nodes": [
        {
          "args": [
            {
              "class_name": "__keras_tensor__",
              "config": {
                "shape": [
                  null,
                  2,
                  125,
                  64
                ],
                "dtype": "float32",
                "keras_history": [
                  "conv1",
                  0,
                  0
                ]
              }
            }
          ],
          "kwargs": {
            "mask": null
          }
        }
      ]
    },
    {
      "module": "keras.layers",
      "class_name": "Dropout",
      "config": {
        "name": "drop1",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "rate": 0.5,
        "seed": null,
        "noise_shape": null
      },
      "registered_name": null,
      "name": "drop1",
      "inbound_nodes": [
        {
          "args": [
            {
              "class_name": "__keras_tensor__",
              "config": {
                "shape": [
                  null,
                  2,
                  125,
                  64
                ],
                "dtype": "float32",
                "keras_history": [
                  "bn1",
                  0,
                  0
                ]
              }
            }
          ],
          "kwargs": {
            "training": false
          }
        }
      ]
    },
    {
      "module": "keras.layers",
      "class_name": "ZeroPadding2D",
      "config": {
        "name": "pad2",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "padding": [
          [
            0,
            0
          ],
          [
            2,
            2
          ]
        ],
        "data_format": "channels_last"
      },
      "registered_name": null,
      "build_config": {
        "input_shape": [
          null,
          2,
          125,
          64
        ]
      },
      "name": "pad2",
      "inbound_nodes": [
        {
          "args": [
            {
              "class_name": "__keras_tensor__",
              "config": {
                "shape": [
                  null,
                  2,
                  125,
                  64
                ],
                "dtype": "float32",
                "keras_history": [
                  "drop1",
                  0,
                  0
                ]
              }
            }
          ],
          "kwargs": {}
        }
      ]
    },
    {
      "module": "keras.layers",
      "class_name": "Conv2D",
      "config": {
        "name": "conv2",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "filters": 64,
        "kernel_size": [
          2,
          8
        ],
        "strides": [
          1,
          1
        ],
        "padding": "valid",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "groups": 1,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "registered_name": null,
      "build_config": {
        "input_shape": [
          null,
          2,
          129,
          64
        ]
      },
      "name": "conv2",
      "inbound_nodes": [
        {
          "args": [
            {
              "class_name": "__keras_tensor__",
              "config": {
                "shape": [
                  null,
                  2,
                  129,
                  64
                ],
                "dtype": "float32",
                "keras_history": [
                  "pad2",
                  0,
                  0
                ]
              }
            }
          ],
          "kwargs": {}
        }
      ]
    },
    {
      "module": "keras.layers",
      "class_name": "BatchNormalization",
      "config": {
        "name": "bn2",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "gamma_initializer": {
          "module": "keras.initializers",
          "class_name": "Ones",
          "config": {},
          "registered_name": null
        },
        "moving_mean_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "moving_variance_initializer": {
          "module": "keras.initializers",
          "class_name": "Ones",
          "config": {},
          "registered_name": null
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null,
        "synchronized": false
      },
      "registered_name": null,
      "build_config": {
        "input_shape": [
          null,
          1,
          122,
          64
        ]
      },
      "name": "bn2",
      "inbound_nodes": [
        {
          "args": [
            {
              "class_name": "__keras_tensor__",
              "config": {
                "shape": [
                  null,
                  1,
                  122,
                  64
                ],
                "dtype": "float32",
                "keras_history": [
                  "conv2",
                  0,
                  0
                ]
              }
            }
          ],
          "kwargs": {
            "mask": null
          }
        }
      ]
    },
    {
      "module": "keras.layers",
      "class_name": "Dropout",
      "config": {
        "name": "drop2",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "rate": 0.5,
        "seed": null,
        "noise_shape": null
      },
      "registered_name": null,
      "name": "drop2",
      "inbound_nodes": [
        {
          "args": [
            {
              "class_name": "__keras_tensor__",
              "config": {
                "shape": [
                  null,
                  1,
                  122,
                  64
                ],
                "dtype": "float32",
                "keras_history": [
                  "bn2",
                  0,
                  0
                ]
              }
            }
          ],
          "kwargs": {
            "training": false
          }
        }
      ]
    },
    {
      "module": "keras.layers",
      "class_name": "ZeroPadding2D",
      "config": {
        "name": "pad3",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "padding": [
          [
            0,
            0
          ],
          [
            1,
            1
          ]
        ],
        "data_format": "channels_last"
      },
      "registered_name": null,
      "build_config": {
        "input_shape": [
          null,
          1,
          122,
          64
        ]
      },
      "name": "pad3",
      "inbound_nodes": [
        {
          "args": [
            {
              "class_name": "__keras_tensor__",
              "config": {
                "shape": [
                  null,
                  1,
                  122,
                  64
                ],
                "dtype": "float32",
                "keras_history": [
                  "drop2",
                  0,
                  0
                ]
              }
            }
          ],
          "kwargs": {}
        }
      ]
    },
    {
      "module": "keras.layers",
      "class_name": "Conv2D",
      "config": {
        "name": "conv3",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "filters": 128,
        "kernel_size": [
          1,
          4
        ],
        "strides": [
          1,
          1
        ],
        "padding": "valid",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "groups": 1,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "registered_name": null,
      "build_config": {
        "input_shape": [
          null,
          1,
          124,
          64
        ]
      },
      "name": "conv3",
      "inbound_nodes": [
        {
          "args": [
            {
              "class_name": "__keras_tensor__",
              "config": {
                "shape": [
                  null,
                  1,
                  124,
                  64
                ],
                "dtype": "float32",
                "keras_history": [
                  "pad3",
                  0,
                  0
                ]
              }
            }
          ],
          "kwargs": {}
        }
      ]
    },
    {
      "module": "keras.layers",
      "class_name": "BatchNormalization",
      "config": {
        "name": "bn3",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "gamma_initializer": {
          "module": "keras.initializers",
          "class_name": "Ones",
          "config": {},
          "registered_name": null
        },
        "moving_mean_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "moving_variance_initializer": {
          "module": "keras.initializers",
          "class_name": "Ones",
          "config": {},
          "registered_name": null
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null,
        "synchronized": false
      },
      "registered_name": null,
      "build_config": {
        "input_shape": [
          null,
          1,
          121,
          128
        ]
      },
      "name": "bn3",
      "inbound_nodes": [
        {
          "args": [
            {
              "class_name": "__keras_tensor__",
              "config": {
                "shape": [
                  null,
                  1,
                  121,
                  128
                ],
                "dtype": "float32",
                "keras_history": [
                  "conv3",
                  0,
                  0
                ]
              }
            }
          ],
          "kwargs": {
            "mask": null
          }
        }
      ]
    },
    {
      "module": "keras.layers",
      "class_name": "Dropout",
      "config": {
        "name": "drop3",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "rate": 0.5,
        "seed": null,
        "noise_shape": null
      },
      "registered_name": null,
      "name": "drop3",
      "inbound_nodes": [
        {
          "args": [
            {
              "class_name": "__keras_tensor__",
              "config": {
                "shape": [
                  null,
                  1,
                  121,
                  128
                ],
                "dtype": "float32",
                "keras_history": [
                  "bn3",
                  0,
                  0
                ]
              }
            }
          ],
          "kwargs": {
            "training": false
          }
        }
      ]
    },
    {
      "module": "keras.layers",
      "class_name": "ZeroPadding2D",
      "config": {
        "name": "pad4",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "padding": [
          [
            0,
            0
          ],
          [
            1,
            1
          ]
        ],
        "data_format": "channels_last"
      },
      "registered_name": null,
      "build_config": {
        "input_shape": [
          null,
          1,
          121,
          128
        ]
      },
      "name": "pad4",
      "inbound_nodes": [
        {
          "args": [
            {
              "class_name": "__keras_tensor__",
              "config": {
                "shape": [
                  null,
                  1,
                  121,
                  128
                ],
                "dtype": "float32",
                "keras_history": [
                  "drop3",
                  0,
                  0
                ]
              }
            }
          ],
          "kwargs": {}
        }
      ]
    },
    {
      "module": "keras.layers",
      "class_name": "Conv2D",
      "config": {
        "name": "conv4",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "filters": 128,
        "kernel_size": [
          1,
          4
        ],
        "strides": [
          1,
          1
        ],
        "padding": "valid",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "groups": 1,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "registered_name": null,
      "build_config": {
        "input_shape": [
          null,
          1,
          123,
          128
        ]
      },
      "name": "conv4",
      "inbound_nodes": [
        {
          "args": [
            {
              "class_name": "__keras_tensor__",
              "config": {
                "shape": [
                  null,
                  1,
                  123,
                  128
                ],
                "dtype": "float32",
                "keras_history": [
                  "pad4",
                  0,
                  0
                ]
              }
            }
          ],
          "kwargs": {}
        }
      ]
    },
    {
      "module": "keras.layers",
      "class_name": "BatchNormalization",
      "config": {
        "name": "bn4",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "gamma_initializer": {
          "module": "keras.initializers",
          "class_name": "Ones",
          "config": {},
          "registered_name": null
        },
        "moving_mean_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "moving_variance_initializer": {
          "module": "keras.initializers",
          "class_name": "Ones",
          "config": {},
          "registered_name": null
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null,
        "synchronized": false
      },
      "registered_name": null,
      "build_config": {
        "input_shape": [
          null,
          1,
          120,
          128
        ]
      },
      "name": "bn4",
      "inbound_nodes": [
        {
          "args": [
            {
              "class_name": "__keras_tensor__",
              "config": {
                "shape": [
                  null,
                  1,
                  120,
                  128
                ],
                "dtype": "float32",
                "keras_history": [
                  "conv4",
                  0,
                  0
                ]
              }
            }
          ],
          "kwargs": {
            "mask": null
          }
        }
      ]
    },
    {
      "module": "keras.layers",
      "class_name": "Dropout",
      "config": {
        "name": "drop4",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "rate": 0.5,
        "seed": null,
        "noise_shape": null
      },
      "registered_name": null,
      "name": "drop4",
      "inbound_nodes": [
        {
          "args": [
            {
              "class_name": "__keras_tensor__",
              "config": {
                "shape": [
                  null,
                  1,
                  120,
                  128
                ],
                "dtype": "float32",
                "keras_history": [
                  "bn4",
                  0,
                  0
                ]
              }
            }
          ],
          "kwargs": {
            "training": false
          }
        }
      ]
    },
    {
      "module": "keras.layers",
      "class_name": "Flatten",
      "config": {
        "name": "flatten",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "data_format": "channels_last"
      },
      "registered_name": null,
      "build_config": {
        "input_shape": [
          null,
          1,
          120,
          128
        ]
      },
      "name": "flatten",
      "inbound_nodes": [
        {
          "args": [
            {
              "class_name": "__keras_tensor__",
              "config": {
                "shape": [
                  null,
                  1,
                  120,
                  128
                ],
                "dtype": "float32",
                "keras_history": [
                  "drop4",
                  0,
                  0
                ]
              }
            }
          ],
          "kwargs": {}
        }
      ]
    },
    {
      "module": "keras.layers",
      "class_name": "Dense",
      "config": {
        "name": "dense1",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "units": 256,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null,
        "quantization_config": null
      },
      "registered_name": null,
      "build_config": {
        "input_shape": [
          null,
          15360
        ]
      },
      "name": "dense1",
      "inbound_nodes": [
        {
          "args": [
            {
              "class_name": "__keras_tensor__",
              "config": {
                "shape": [
                  null,
                  15360
                ],
                "dtype": "float32",
                "keras_history": [
                  "flatten",
                  0,
                  0
                ]
              }
            }
          ],
          "kwargs": {}
        }
      ]
    },
    {
      "module": "keras.layers",
      "class_name": "Dropout",
      "config": {
        "name": "drop_dense",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "rate": 0.5,
        "seed": null,
        "noise_shape": null
      },
      "registered_name": null,
      "name": "drop_dense",
      "inbound_nodes": [
        {
          "args": [
            {
              "class_name": "__keras_tensor__",
              "config": {
                "shape": [
                  null,
                  256
                ],
                "dtype": "float32",
                "keras_history": [
                  "dense1",
                  0,
                  0
                ]
              }
            }
          ],
          "kwargs": {
            "training": false
          }
        }
      ]
    },
    {
      "module": "keras.layers",
      "class_name": "Dense",
      "config": {
        "name": "classifier",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "units": 11,
        "activation": "softmax",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null,
        "quantization_config": null
      },
      "registered_name": null,
      "build_config": {
        "input_shape": [
          null,
          256
        ]
      },
      "name": "classifier",
      "inbound_nodes": [
        {
          "args": [
            {
              "class_name": "__keras_tensor__",
              "config": {
                "shape": [
                  null,
                  256
                ],
                "dtype": "float32",
                "keras_history": [
                  "drop_dense",
                  0,
                  0
                ]
              }
            }
          ],
          "kwargs": {}
        }
      ]
    }
  ],
  "input_layers": [
    "iq_input",
    0,
    0
  ],
  "output_layers": [
    "classifier",
    0,
    0
  ]
}